  export const osagoItems = [
  {
    img: require("@/assets/images/osago/howItWorks/document.svg"),
    title: "Заполните все данные по клиенту",
    lines: [
      "Автоматическое подтягивание данных по гос. номеру",
      "Автоматический поиск техосмотра",
      "Проверка КБМ по каждому водителю",
      "Умные подсказки, увеличивающие шанс оформления",
      "Самый обширный список марок и моделей",
    ],
  },
  {
    img: require("@/assets/images/osago/howItWorks/config.svg"),
    title: "Выберите страховую компанию из списка",
    lines: [
      "Сравнивайте цены и размер вашего вознаграждения",
      "Узнайте причину отказа СК",
      "Мы подскажем минимальную дату начала по каждой компании",
      "Проверьте коэффициенты расчёта",
      "Получите +5% вознаграждения за чужую пролонгацию",
    ],
  },
  {
    img: require("@/assets/images/osago/howItWorks/email.svg"),
    title: "Отправьте ссылку на оплату клиенту",
    lines: [
      "Отправляйте ссылку на оплату в СМС или письме прямо из личного кабинета",
      "Оплата напрямую в страховую компанию",
      "Полис отправится клиенту на почту и будет у вас в личном кабинете",
    ],
  },
  {
    img: require("@/assets/images/osago/howItWorks/bag.svg"),
    title: "Получите своё вознаграждение на баланс",
    lines: [
      "После оплаты, вознаграждение будет начислено на ваш баланс",
      "Выводите деньги на любые реквизиты физ. лица, ИП/ООО или используйте для оплаты других сервисов",
    ],
  },
];
export const kaskoItems = [
  {
    img: require("@/assets/images/osago/howItWorks/document.svg"),
    title: "Заполните данные, выберите оптимальный расчет и отправьте заявку",
  },
  {
    img: require("@/assets/images/osago/howItWorks/config.svg"),
    title: "Мы свяжемся с вами, уточним детали, запросим документы",
  },
  {
    img: require("@/assets/images/osago/howItWorks/email.svg"),
    title: "При необходимости согласуем дату осмотра авто",
  },
  {
    img: require("@/assets/images/osago/howItWorks/bag.svg"),
    title: "Оформим полис и начислим вам комиссию",
  },
];
