export const finHIWCards = [
  "<span id='step1-reg-link' style='cursor: pointer;; color: #7245FF;'>Зарегистрируйтесь</span> на&nbsp;платформе Пампаду",
  "Используя подборщик, выберите подходящий финансовый продукт",
  "Отправьте ссылку для оформления своему клиенту",
  "Получите вознаграждение на баланс после подтверждения целевого действия банком",
];
export const hrHIWCards = [
  "<span id='step1-reg-link' style='cursor: pointer;; color: #7245FF;'>Зарегистрируйтесь</span> на&nbsp;платформе Пампаду",
  "Используя подборщик, выберите подходящую вакансию",
  "Отправьте ссылку потенциальному соискателю",
  "Получите вознаграждение на баланс после подтверждения целевого действия работодателем",
];
export const rkoHIWCards = [
  "<span id='step1-reg-link' style='cursor: pointer;; color: #7245FF;'>Зарегистрируйтесь</span> на&nbsp;платформе Пампаду",
  "Используя подборщик, выберите банк для открытия расчетного счета",
  "Отправьте ссылку для оформления клиенту или заполните самостоятельно",
  "Получите вознаграждение на баланс после подтверждения целевого действия банком",
];
export const rkoHIWCardsWebtools = [
  "Интегрируйте виджет на свой сайт/в приложение или создайте отдельную витрину или разместите реферальную ссылку на своём сайте или интернете",
  "Начните приводить трафик на страницу",
  "Отслеживайте продажи онлайн с помощью инструментов статистики в личном кабинете или настройте постбеки",
  "Получайте моментальные выплаты на свой расчётный счёт или карту за подтверждённые продажи"
];
