export type WhosNeedItem = {
  title: string;
  description: string[];
};

export const osagoItems = [
  {
    title: "Профессиональные и начинающие страховые агенты, включая кураторов",
    description: [
      "Сможете оформлять большую часть регионов РФ&nbsp;по&nbsp;ОСАГО. Не&nbsp;отказывайте клиенту, если у&nbsp;него не&nbsp;местная прописка или не&nbsp;проходит сегментацию.",
      "Не&nbsp;нужно заключать договоры со страховыми компаниями. Мы уже это сделали!",
      "Не&nbsp;нужно забирать и отвозить бланки строгой отчётности, квитанции и&nbsp;акты. Все в&nbsp;онлайн!",
      "Развивайте, курируйте свою агентскую сеть и&nbsp;зарабатывайте больше.",
    ],
  },
  {
    title: "Малый, средний и крупный бизнес,<br>даже такие, как Газпромнефть",
    description: [
      "У вас автошкола, автосервис, станция техосмотра, мойка или есть постоянный поток автомобилистов.",
      "Зарабатывайте на&nbsp;дополнительной услуге — оформление полиса обязательного автострахования ОСАГО.",
      "Не нужно регистрировать дополнительный вид деятельности или вносить изменения в&nbsp;учредительные документы.",
    ],
  },
  {
    title: "Вебмастера, блогеры<br>и&nbsp;арбитражные команды",
    description: [
      "Для всех у кого есть трафик или аудитория автомобилистов на покупку полисов ОСАГО.",
      "Установите за 5&nbsp;минут наш виджет расчета и покупки автострахования и&nbsp;получайте комиссию с&nbsp;каждого проданного полиса через ваш сайт.",
      "Пользуйтесь дополнительными инструментами: баннеры, реферальные ссылки, white-label",
    ],
  },
  {
    title: "Все, кто искали дополнительный доход или работу на дому",
    description: [
      "Стать страховым агентом легко: регистрируйтесь и через 5&nbsp;минут оформляйте первый полис.",
      "Личный куратор, обучающие видео и полезные статьи будут вам в помощь.",
      "Помогайте клиентам с&nbsp;оформлением ОСАГО и&nbsp;других видов страхования, не выходя из дома.",
      "Рассказывайте и&nbsp;рекламируйте свои услуги в социальных сетях. Все автомобилисты  — это ваши клиенты, а&nbsp;ОСАГО — обязательный вид страхования.",
    ],
  },
];

export const finOfferItems = [
  {
    title:
      "Страховые и финансовые посредники, которые имеют опыт агентских продаж",
    description: [
      "Сможете работать из любой точки мира со всеми регионами РФ (кроме Крыма).",
      "Не&nbsp;нужно заключать договоры со страховыми компаниями и банками. Мы уже это сделали!",
      "Не&nbsp;нужно забирать и отвозить бланки строгой отчётности, квитанции и&nbsp;акты. Все в&nbsp;онлайн!",
      "Развивайте, курируйте свою агентскую сеть и&nbsp;зарабатывайте больше.",
    ],
  },
  {
    title:
      "Крупные страховые и кредитные брокеры, риэлтерские агентства и ломбарды",
    description: [
      "Вы управляете собственной агентской сетью и ищите новые продукты для ее расширения и увеличения дохода.",
      "У вас риэлтерское агентство, или вы риелтор, который имеет собственную сеть агентов.",
      "У вас МФО, сеть скупок или ломбардов, и вы хотите увеличить доход.",
    ],
  },
  {
    title: "Вебмастера, блогеры<br>и&nbsp;арбитражные команды",
    description: [
      "Для всех у кого есть трафик или аудитория на оформление топовых банковских карт.",
      "Установите за 5&nbsp;минут наш виджет каталога финансовых продуктов и&nbsp;получайте комиссию с&nbsp;каждого проданного финансового продукта через ваш сайт.",
      "Пользуйтесь дополнительными инструментами: баннеры, реферальные ссылки, white-label",
    ],
  },
  {
    title: "Все, кто искали дополнительный доход или работу на дому",
    description: [
      "Стать агентом Пампаду легко: регистрируйтесь и через 5&nbsp;минут оформляйте первый полис.",
      "Личный куратор, обучающие видео и полезные статьи будут вам в помощь.",
      "Помогайте клиентам с&nbsp;оформлением финансовых продуктов, ОСАГО и&nbsp;других видов страхования, не выходя из дома.",
      "Рассказывайте и&nbsp;рекламируйте свои услуги в социальных сетях. Всем нужны выгодные дебетовые карты.",
    ],
  },
];

export const minikaskoItems = [
  {
    title: "Профессиональные и начинающие страховые агенты",
    description: [
      "Оформляйте полисы для большей части регионов РФ. Работайте в удобном для себя графике, когда и где вам угодно — хоть из дома на диване.",
      "Приступайте к оформлению полисов сразу после регистрации. Без заключения договоров со страховыми компаниями. Мы уже это сделали.",
      "Не тратьте время и усилия на сбор квитанций и актов, работу с бланками строгой отчетности. Все в онлайн! Получайте и выводите комиссионное вознаграждение сразу после оплаты полисов.",
    ],
  },
  {
    title: "Крупные брокеры",
    description: [
      "Курируйте и расширяйте свою агентскую сеть с помощью функционала платформы.",
      "Привлекайте и обучайте агентов с помощью обучающих материалов платформы.",
      "Устанавливайте самостоятельно размер своей комиссии с продаж агентской сети.",
      "Используйте возможность пассивного заработка на реферальной программе.",
    ],
  },
  {
    title: "Юристы по страховым спорам",
    description: [
      "Помогайте клиентам не только с разрешением споров в судебном порядке, но и предлагайте гарантированную страховую защиту.",
      "Все ваши подзащитные — это потенциальные покупатели полисов.",
      "Ведите базу клиентов и продлевайте полисы в последующие годы с выгодой для себя и клиента.",
    ],
  },
  {
    title: "Все, кого интересует работа на дому",
    description: [
      "Стать страховым агентом легко: регистрируйтесь и через 5 минут оформляйте первый полис.",
      "Личный куратор, обучающие видео и полезные статьи будут вам в помощь.",
      "Помогайте друзьям и знакомым с оформлением ОСАГО других видов страхования и финансовых продуктов не выходя из дома.",
      "Рассказывайте и рекламируйте свои услуги в социальных сетях. Все автомобилисты — это ваши клиенты.",
    ],
  },
];
export const hrItems = [
  {
    title: "Опытные и начинающие HR фрилансеры",
    description: [
      "Сможете работать из любой точки мира со всеми регионами РФ (кроме Крыма).",
      "Не&nbsp;нужно заключать договоры с работодателями. Мы уже это сделали!",
      "Не&nbsp;нужно забирать и отвозить бланки строгой отчётности, квитанции и&nbsp;акты. Все в&nbsp;онлайн!",
      "Развивайте, курируйте свою агентскую сеть и&nbsp;зарабатывайте больше.",
    ],
  },
  {
    title: "HR агентства по всей России",
    description: [
      "Вы управляете собственной сетью HR и ищите новых работодателей для ее расширения и увеличения дохода.",
      "У вас HR агентство, или вы рекрутер, который имеет собственную сеть агентов.",
    ],
  },
  {
    title: "Вебмастера, блогеры и арбитражные команды",
    description: [
      "Для всех, у кого есть трафик или аудитория, заинтересованная в подработке или работе.",
      "Установите за 5&nbsp;минут наш виджет вакансий и&nbsp;получайте комиссию за&nbsp;каждый выход сотрудника на работу или валидную заявку.",
      "Пользуйтесь дополнительными инструментами: баннеры, реферальные ссылки, white-label",
    ],
  },
  {
    title: "Все, кто искали дополнительный доход или работу на дому",
    description: [
      "Стать агентом Пампаду легко: регистрируйтесь и через 5&nbsp;минут оформляйте первый полис.",
      "Личный куратор, обучающие видео и полезные статьи будут вам в помощь.",
      "Помогайте клиентам с&nbsp;трудоустройством, оформлением финансовых продуктов, ОСАГО и&nbsp;других видов страхования, не выходя из дома.",
      "Рассказывайте и&nbsp;рекламируйте свои услуги в социальных сетях. Всем нужна работа.",
    ],
  },
];
