<template>
  <div class="generic-container-1260">
    <div class="partner-capability">
      <div v-if="ic.url === ics.Sogaz">
        <p class="mb-2" style="font-weight: bold" v-html="'Преимущества работы с платформой'"/>
        <ol style="list-style-type: unset">
          <li>Работайте не выходя из дома – зарегистрировавшись на платформе, вы сможете оформить полис ОСАГО, Ипотеки, Мини-КАСКО уже через  5-10 минут из любой точки мира в любое время суток. Он подгружается в кабинете и приходит на почту страхователя сразу после оплаты</li>
          <li>Работайте с клиентами из всех регионов России, а не только с теми, которые привязаны к конкретному филиалу страховой компании</li>
          <li>Работайте в одном месте со всеми продуктами сразу. Зачастую по прямым договорам с СК можно работать только по конкретному направлению страхования - автострахование, страхование жизни, имущества, добровольное медицинское страхование</li>
          <li>Получайте агентское вознаграждение за услуги страхования: моментальные выплаты на карту для самозанятых (в течение 15 минут) и быстрые выплаты на карту физлицам (в течение 1-3 дней)</li>
          <li>Можно работать с клиентами онлайн, достаточно знать их данные по машине или ипотеке</li>
          <li>Экспертная консультация сотрудников техподдержки 7 дней в неделю. Новые пользователи могут пройти обучение по работе с платформой, получить от специалистов оперативный ответ на любой вопрос.</li>
        </ol>
        <open-chat/>
      </div>
      <div v-else-if="ic.url === ics.Vsk">
        <p class="mb-2" style="font-weight: bold" v-html="'Преимущества работы с платформой'"/>
        <ol style="list-style-type: unset">
          <li>Работа агентом ВСК и других страховых компаний через удобный личный кабинет. Оформляйте полисы ОСАГО, Ипотеки, Мини-КАСКО за 5-10 минут работая из дома. Полис подгружается в агентский кабинет и приходит на почту страхователя сразу после оплаты</li>
          <li>Вам будет доступна работа с клиентами из всех регионов России, а не только с теми, которые привязаны к конкретному филиалу страховой компании</li>
          <li>Работайте в одном месте со всеми продуктами сразу. Зачастую по прямым договорам с СК можно работать только по конкретному направлению страхования - жизни, имущества, ДМС, автострахованию.</li>
          <li>Моментальные выплаты вознаграждения на карту для самозанятых (в течение 15 минут) и быстрые выплаты на карту физлицам (в течение 1-3 дней)</li>
          <li>Можно работать с клиентами онлайн, достаточно знать их данные по машине или ипотеке</li>
          <li>Экспертная консультация сотрудников техподдержки 7 дней в неделю. Новые пользователи могут пройти обучение по работе с платформой, получить от специалистов оперативный ответ на любой вопрос, а также помощь в оформлении полисов</li>
          <li>Обширная база знаний в <a :href="blogLink" class="link" target="_blank">блоге</a> на нашем <a class="link" :href="youtubeLink" target="_blank">Youtube-канале</a></li>
        </ol>
        <open-chat/>
      </div>
      <div v-else-if="ic.url === ics.Tinkoff">
        <p class="mb-2" style="font-weight: bold" v-html="'Преимущества работы с платформой'"/>
        <ol style="list-style-type: unset">
          <li>Работайте не выходя из дома – зарегистрировавшись на платформе, вы сможете оформить полис ОСАГО, Ипотеки, Мини-КАСКО уже через  5-10 минут из любой точки мира в любое время суток. Полис подгружается в кабинете и приходит на почту страхователя сразу после оплаты</li>
          <li>Работайте с клиентами из всех регионов России, а не только с теми, которые привязаны к конкретному филиалу страховой компании</li>
          <li>Работайте в одном месте со всеми продуктами сразу. Зачастую по прямым договорам с СК можно работать только по конкретному направлению страхования - автострахование, страхование жизни, имущества, добровольное медицинское страхование</li>
          <li>Получайте агентское вознаграждение за услуги страхования: моментальные выплаты на карту для самозанятых (в течение 15 минут) и быстрые выплаты на карту физлицам (в течение 1-3 дней)</li>
          <li>Можно работать с клиентами онлайн, достаточно знать их данные по машине или ипотеке</li>
          <li>Экспертная консультация сотрудников техподдержки 7 дней в неделю. Новые пользователи могут пройти обучение по работе с платформой, получить от специалистов оперативный ответ на любой вопрос, а также помощь в оформлении полисов</li>
        </ol>
        <open-chat/>
      </div>
      <div v-else-if="ic.url === ics.Sberbank">
        <p class="mb-2" style="font-weight: bold" v-html="'Преимущества работы с платформой'"/>
        <ol style="list-style-type: unset">
          <li>Пампаду - мощная платформа, объединяющая компетенции в IT и в страховании. Работа агентом Сбера и других СК через удобный личный кабинет. Оформляйте полисы страхования ОСАГО, Ипотеки, Мини-КАСКО за 5-10 минут работая из дома. Полис подгружается в кабинете и приходит на почту страхователя сразу после оплаты</li>
          <li>Агентам доступна работа с клиентами из всех регионов России, а не только с теми, которые привязаны к конкретному филиалу страховой компании</li>
          <li>Работайте в одном месте со всеми продуктами сразу. Зачастую по прямым договорам с СК можно работать только по конкретному направлению страхования - автострахование, страхование жизни, имущества, добровольное медицинское страхование</li>
          <li>Моментальные выплаты агенту Сбера на карту для самозанятых (в течение 15 минут) и быстрые выплаты на карту физлицам (в течение 1-3 дней)</li>
          <li>Можно работать с клиентами онлайн, достаточно знать их данные по машине или ипотеке</li>
          <li>Экспертная консультация сотрудников техподдержки 7 дней в неделю. Новые пользователи могут пройти обучение по работе с платформой, получить от специалистов оперативный ответ на любой вопрос, а также помощь в оформлении полисов</li>
        </ol>
        <open-chat/>
      </div>
      <div v-else>
        <p class="mb-2" v-html="icText.title"/>
        <span style="color: #8e68ff">Регистрируйтесь на платформе Пампаду</span>, чтобы вы могли получить доступ к
        следующим функциям:
        <ol>
          <li v-for="(item,index) in orderedList" :key="index">
            {{ item.text }}
            <ul v-if="item.subItems">
              <li v-for="subItem in item.subItems">— {{ subItem }}</li>
            </ul>
          </li>
        </ol>
        <div class="mt-4">
          <div v-if="ic.url === ics.Ingosstrah">
            <p>
              Экономьте свое время! Не нужно ехать в офис, договариваться с СК “{{ ic.name }}” о сотрудничестве, возить
              договора,
              бланки и отчёты, ведь у вас есть возможность оформить полис онлайн и использовать все необходимые
              инструменты
              для
              работы агента бесплатно через наш сайт! Мы добавили максимально большое количество опций, которые может
              попробовать любой человек, желающий стать страховым агентом. Чтобы проверить наличие конкретной услуги,
              нужно
              открыть личный кабинет
            </p>
            <p>
              Не бойтесь столкнуться со сложностями при работе с сервисом. Обучением активных пользователей занимаются
              сопровождающие менеджеры. Они помогут вам растить продажи, зарабатывать больше, и получить исключительно
              положительный опыт при работе с платформой
            </p>
            <h2 style="font-weight: bold">Стабильные выплаты — быстрее, чем в страховых компаниях и у большинства
              платформ</h2>
            <ul>
              <li>— Моментальные выплаты на карту для самозанятых - в течение 15 минут</li>
              <li>— Быстрые выплаты на карту физлицам - в течение 1-3 дней</li>
              <li>— Раз в месяц на расчетный счет юрлицам (счета-фактуры и все необходимые закрывающие документы
                подготовим за вас)
              </li>
            </ul>
          </div>
          <div v-else-if="ic.url === ics.Reso">
            <p>
              Не нужно ехать в офис, договариваться с СК «РЕСО-Гарантия» о сотрудничестве, возить договора, бланки и
              отчёты,
              ведь у вас есть возможность оформить полис онлайн и использовать все необходимые инструменты для работы
              агента бесплатно через наш сайт!
              Мы добавили максимально большое количество опций, которые может попробовать любой желающий.
              Чтобы проверить наличие конкретной услуги, нужно открыть личный кабинет
            </p>
            <h2 style="font-weight: bold">Преимущества работы с платформой</h2>
            <ul class="benefits">
              <li class="benefit-item" v-for="item in benefits" v-html="`— ${item}`"/>
            </ul>
            <div class="mt-3">
              Остались вопросы? <span @click="openChat" class="open-chat">Напишите нам в чат</span>, на сайте, мы помогаем
              7 дней в неделю. Вы также можете сделать это в личном кабинете или позвонить нам напрямую
              Вы сможете сэкономить свое время! Просто используйте наш сервис, чтобы легко проводить все операции, даже
              через через мобильный телефон. Вам нужно всего лишь войти в личный кабинет и, став агентом, начать
              зарабатывать на страховании!
            </div>
          </div>
          <div class="mt-5">
            <nuxt-link class="agents-link"  :to="{name: 'agents' }" v-html="icLinkTitle"/>
          </div>
        </div>
      </div>
    </div>
  </div>
</template>

<script lang="ts">
import {Component, Prop, Vue} from "vue-property-decorator"
import {IcModel} from "~/model/entities/ic-partner";
import { IcUrl } from "~/urls";
import OpenChat from "~/components/ic-partner/OpenChat.vue";

type OrderedItem = {
  text: string,
  subItems?: string[],
}

type CapabilityText = {
  title: string;
}
@Component({
  components: {OpenChat}
})
export default class Capability extends Vue {
  @Prop(Object) ic: IcModel;
  ics = IcUrl

  blogLink = 'https://pampadu.ru/blog/'
  youtubeLink = 'https://www.youtube.com/channel/UC0SeTdHMfY67ku8e7m-GMTw'

  orderedList: OrderedItem[] = [
    {text: 'Рассчитать и оформить ОСАГО, КАСКО, мини-КАСКО, полис ипотечного страхования'},
    {text: 'Страховать юрлиц по всем видам — от автострахования и ДМС до страхования строительно-монтажных рисков'},
    {text: 'Получать комиссионное вознаграждение до 40%'},
    {text: 'Работать в статусе юрлица, физлица или самозанятого на ваш выбор'},
    {text: 'Выводить заработанное быстро и в любое время, если зарегистрируетесь в качестве физлица или самозанятого'},
    {text: 'Избавиться от бумажной волокиты, если зарегистрируетесь как юрлицо, — все закрывающие документы мы оформим сами, вам останется их только подписать'},
    {
      text: 'Использовать полезные инструменты:',
      subItems: [
        'проверки истории КБМ водителей — бесплатно',
        'восстановления КБМ водителей — за 25 рублей',
        'оформления договоров купли-продажи транспортных средств — бесплатно',
      ],
    },
    {
      text: 'Пассивно зарабатывать с помощью:',
      subItems: [
        'калькуляторов ОСАГО и Ипотеки — просто разместите их у себя на сайте, в приложении или на странице соцсети',
        'агентской сети — подключайте других агентов, курируйте их работу и сами решайте, какую долю с их продаж оставлять себе',
        'реферальной сети — приглашайте на платформу друзей и знакомых и получайте по 50 рублей с каждой продажи агентов, зарегистрировавшихся по вашей ссылке',
      ],
    },
    {text: 'Получать профессиональную поддержку 7 дней в неделю'},
  ];
  benefits = [
    'Работайте не выходя из дома – оформление полисов ОСАГО, Ипотеки, Мини-КАСКО занимает за 5-10 минут и доступно из любой точки мира в любое время суток. Полис подгружается в кабинете и приходит на почту страхователя сразу после оплаты',
    'Работайте с клиентами из всех регионов России, а не только с теми, которые привязаны к конкретному филиалу страховой компании',
    'Работайте в одном месте со всеми продуктами сразу. Зачастую по прямым договорам с СК можно работать только по конкретному направлению страхования - автострахование, страхование жизни, имущества, добровольное медицинское страхование',
    'Моментальные выплаты на карту для самозанятых (в течение 15 минут) и быстрые выплаты на карту физлицам (в течение 1-3 дней)',
    'Можно работать с клиентами онлайн, достаточно знать их данные по машине или ипотеке',
    'Экспертная консультация сотрудников техподдержки 7 дней в неделю. Новые пользователи могут пройти обучение по работе с платформой, получить от специалистов оперативный ответ на любой вопрос, а также помощь в оформлении полисов'
  ]

  get icText(): CapabilityText {
    const ics = {
      [IcUrl.Reso]: {
        title: `Ищете вход в личный кабинет СК «РЕСО»?`,
      },
    }
    const defaultText: CapabilityText = {
      title: `Ищете вход в личный кабинет ${this.ic.name}?`,
    }
    return ics[this.ic.url] ?? defaultText;
  }

  get icLinkTitle() {
    const ics = {
      [IcUrl.Ingosstrah] : 'Главная / Перейти по ссылке для работы с СК Ингосстрах',
    }
    const defaultText = `Главная / Перейти по ссылке на сайт`;
    return ics[this.ic.url] ?? defaultText;
  }

  openChat() {
    (window as any).carrotquest?.open();
  }
}
</script>

<style lang="scss">
.partner-capability {
  padding: 20px 0;

  ul {
    list-style-type: none;
    padding-left: unset;
  }

  .link {
    text-decoration: underline;
    cursor: pointer;
    color: #8E68FF !important;
    font-weight: bold;
  }

  .agents-link {
    text-decoration: underline;
  }
}

</style>
