<template>
  <div class="generic-container-1260 additionalMortgage">
    <h3 class="h4">Партнерская программа страхования ипотеки для риелторов и агентств</h3>
    <p>Если вы риелтор, брокер, страховой агент то тогда вы можете помочь своим клиентам оформить ипотечное страхование выгоднее, чем в банке. Благодаря вам они смогут сэкономить до 20-30% стоимости, а вы получите дополнительный заработок. Кто может воспользоваться сервисом?
  <ul>
  <li>Риелторы; </li>
  <li>Ипотечные брокеры;</li>
  <li>Юристы;</li>
  <li>Страховые агенты;</li>
  <li>Веб-мастера;</li>
  <li>Арбитражники;</li>
  <li>Владельцы веб-сайтов;</li>
  <li>Агентства недвижимости.</li>
</ul>
      <span v-if="readMore"></span>
      <span v-else></span>
    </p>

    <div v-show="readMore">
      <p>Преимущества для партнеров
        Наши партнеры получают возможность получения дохода на обязательном страховании ипотеки уже сразу после регистрации на сайте. Мы сотрудничаем с большим количеством страховых компани и банкой. Почему стоит работать с Пампаду?
      </p>
      <ul>
        <li>Регистрация занимает не более двух минут времени, и мы предоставляем все условия для комфортной работы и заработка;</li>
        <li>Вы сразу получаете доступ к онлайн-оформлению договоров в своем кабинете;</li>
        <li>Есть функциональный личный кабинет, масса рабочих инструментов для привлечения клиентов, круглосуточная поддержка;</li>
        <li>Наша программа позволяет существенно увеличивать клиентскую базу, повышая доверие и лояльность заемщиков;</li>
        <li> Дополнительный доход без больших комиссий до 60% от каждой совершенной сделки;</li>
        <li>Моментальные выплаты юр.лицами и физ.лицам.</li>
      </ul>
      <p>
        Условия работы
      </p>
      <p>Сотрудничать с нами может любой агент, желающий зарабатывать. </p>
      <p>Как организовывается сотрудничества?</p>
      <p>Зарегистрироваться могут самозанятые лица, ООО, индивидуальные предприниматели, физические лица. Сразу после двухминутной регистрации вам будет доступен личный кабинет, в котором можно увидеть статистику по количеству продаваемых полисов. Все полиса оформляются удаленно в личном кабинете, после чего вы отправляете полис клиенту. После получения полиса рассчитывается и выплачивается вознаграждение агенту.</p>
      <p>Участие в партнерской программе страхования ипотеки – это выгодно, доступно, быстро. Удаленно из дома вы можете зарабатывать до 60% с оформления полиса. Регистрируйтесь прямо сейчас!  </p>
    </div>
    <button class="additionalMortgage__button" @click="readMore =! readMore">
      <span v-if="readMore">Читать менее</span>
      <span v-else>Читать далее</span>
    </button>
  </div>
</template>

<script lang="ts">
import {Vue, Component} from 'vue-property-decorator';

@Component

export default class AdditionalMortgage extends Vue {
     readMore: boolean = false;
}
</script>

<style scoped lang="scss">
.additionalMortgage {
  >h3{
    padding: 20px;
    text-align: center;
    font-weight: bold;
  }
  &__button{
    color: #AB54FF;
  }
}


</style>
